%Вариант1. Задачи 37,43,59
%1.37 Дан целочисленный массив. 
%Вывести индексы элементов, которые 
%меньше своего левого соседа, и количество таких чисел.


%1.43 Дан целочисленный массив. 
%Необходимо найти количество минимальных элементов.

%1.59 Дан список. Построить новый список 
% из квадратов неотрицательных чисел, 
% меньших 100 и встречающихся в массиве больше 2 раз.

%14 Беседует трое друзей: Белокуров, Рыжов, Чернов. 
%Брюнет сказал Белокурову: “Любопытно, что один из нас блондин, 
%другой брюнет, третий - рыжий, но ни у кого цвет волос не соответствует фамилии”. 
%Какой цвет волос у каждого из друзей?

%15 Три подруги вышли в белом, зеленом и синем платьях и туфлях. 
% Известно, что только у Ани цвета платья и туфлей совпадали. 
% Ни туфли, ни платье Вали не были белыми. 
% Наташа была в зеленых туфлях. 
% Определить цвета платья и туфель на каждой из подруг.

%16 На заводе работали три друга: слесарь, токарь и сварщик. 
% Их фамилии Борисов, Иванов и Семенов. 
% У слесаря нет ни братьев, ни сестер. Он самый младший из друзей. 
% Семенов, женатый на сестре Борисова, старше токаря. 
% Назвать фамилии слесаря, токаря и сварщика.

%17 В бутылке, стакане, кувшине и банке находятся молоко, лимонад, квас и вода. 
% Известно, что вода и молоко не в бутылке, 
% сосуд с лимонадом находится между кувшином и сосудом с квасом, 
% в банке - не лимонад и не вода. 
% Стакан находится около банки и сосуда с молоком. 
% Как распределены эти жидкости по сосудам.

%18 Воронов, Павлов, Левицкий и Сахаров – четыре талантливых молодых человека. 
%   Один из них танцор, другой художник, третий-певец, а четвертый-писатель. 
%   О них известно следующее: Воронов и Левицкий сидели в зале консерватории 
%   в тот вечер, когда певец дебютировал в сольном концерте. 
%   Павлов и писатель вместе позировали художнику. 
%   Писатель написал биографическую повесть о Сахарове и собирается написать о Воронове. 
%   Воронов никогда не слышал о Левицком. Кто чем занимается?

%19 Три друга заняли первое, второе, третье места в соревнованиях универсиады. 
% Друзья разной национальности, зовут их по-разному, и любят они разные виды спорта. 
% Майкл предпочитает баскетбол и играет лучше, чем американец. 
% Израильтянин Саймон играет лучше теннисиста. 
% Игрок в крикет занял первое место. 
% Кто является австралийцем? Каким спортом увлекается Ричард?

%20.1 Как то раз случай свёл в купе астронома, поэта, прозаика и драматурга. 
% Это были Алексеев, Борисов, Константинов и Дмитриев. Оказалось, 
% что каждый из них взял с собой книгу написанную одним из пассажиров этого купе. 
% Алексеев и Борисов углубились в чтение предварительно обменявшись книгами. 
% Поэт читал пьесу, прозаик — очень молодой человек, выпустивший свою книгу, 
% говорил что он никогда и ни чего не читал по астрономии. 
% Борисов купил одно из произведений Дмитриева. 
% Никто из пассажиров не читал свои книги. 
% Что читал каждый из них, кто кем был?
